//+------------------------------------------------------------------+
//|                                                           Pi.mq4 |
//|                                                    Привалов С.В. |
//|                                             Skype -> privalov-sv |
//+------------------------------------------------------------------+
#property copyright "Привалов С.В."
#property link      "Skype -> privalov-sv"

//+------------------------------------------------------------------+
//| script program start function                                    |
//+------------------------------------------------------------------+
int start()
  {
//----
   // чем больше циклов - тем больше точность
   // в данном варианте совпадает со вложенной в MathCad константой пи   
   double Pi=0.0;
   for(double i=0; i<11; i++) Pi+= 1/MathPow(16,i)*(4/(8*i+1)-2/(8*i+4)-1/(8*i+5)-1/(8*i+6));
   Print("Pi=",DoubleToStr(Pi,8));
//----
   return(0);
  }
//+------------------------------------------------------------------+