//+------------------------------------------------------------------+
//|                                                   analizBara.mq4 |
//|                                                     Yuriy Tokman |
//|                                            yuriytokman@gmail.com |
//+------------------------------------------------------------------+
#property copyright "Yuriy Tokman"
#property link      "yuriytokman@gmail.com"

//+------------------------------------------------------------------+
//| script program start function                                    |
//+------------------------------------------------------------------+
int start()
  {
//----
 double i=(High[1]-Low[1])/3;                           //размер трети бара
 
  if((Open[1]>(Low[1]+2*i))&&(Close[1]>(Low[1]+2*i)))   //цена открытия и цена закрытия
                                                        //находятся
                                                        //в первой трети бара, в верху
   MessageBox("1-1 *приближение-избегание* ","Бар №");
   
  if((Open[1]>=(Low[1]+i))&&(Open[1]<=(High[1]-i))&&    //цена открытия находиться во второй
                                                        //трети бара, в середине
    (Close[1]>=(Low[1]+i))&&(Close[1]<=(High[1]-i)))    //цена закрытия находиться во второй
                                                        //трети бара, в середине 
   MessageBox("2-2 *нейтральный или волчек* ","Бар №");
   
  if((Open[1]<(High[1]-2*i))&&(Close[1]<(High[1]-2*i))) //цена открытия и цена закрытия 
                                                        //находятся в третей трети бара,
                                                        //в нижней части бара
   MessageBox("3-3 *приближение-избегание* ","Бар №");
                                       
                            //БАРЫ АЛЬПИНИСТЫ
                            
  if((Open[1]<(High[1]-2*i))&&(Close[1]>(Low[1]+2*i)))
                            
   MessageBox("3-1 *Альпинист* ","Бар №");
   
  if((Open[1]>=(Low[1]+i))&&(Open[1]<=(High[1]-i))&&(Close[1]>(Low[1]+2*i)))
    
   MessageBox("2-1 *Альпинист* ","Бар №");
   
  if((Open[1]<(High[1]-2*i))&&(Close[1]>=(Low[1]+i))&&(Close[1]<=(High[1]-i)))
  
   MessageBox("3-2 *Альпинист* ","Бар №");
   
                            //БАРЫ БРОДЯГИ
                             
  if((Open[1]>(Low[1]+2*i))&&(Close[1]<(High[1]-2*i)))
   
   MessageBox("1-3 *Бродяга* ","Бар №");
    
  if((Open[1]>=(Low[1]+i))&&(Open[1]<=(High[1]-i))&&(Close[1]<(High[1]-2*i)))
  
   MessageBox("2-3 *Бродяга* ","Бар №");
   
  if((Open[1]>(Low[1]+2*i))&&(Close[1]>=(Low[1]+i))&&(Close[1]<=(High[1]-i)))
  
   MessageBox("1-2 *Бродяга* ","Бар №");                           
                            
   
      
//----
   return(0);
  }
//+------------------------------------------------------------------+